"""Тут содержаться некоторые переменные(константы) для проекта Foodgram"""

#минимальное количество символов для username
MIN_LEN_FOR_USERNAME = 5

#максимальная количество символов для username
MAX_LEN_FOR_USERNAME = 150

#Сообщение об ошибки пароля
ERROR_MESSAGE_PASSWORD = 'Пароль не может быть пустым или меньше четырех символов!'

#Неверный текущий пароль
ERROR_CURRENT_PASSWORD = 'Текущий пароль указан не верно!'

#Email нету в базе данных
NOT_EMAIl_IN_DB =   'Такой почты нет в базе данных!.'

#неверный пароль для пользователя с указанной почтой
NOT_TRUE_PASSWORD = 'Не верный пароль для пользователя с указанной почтой!'

#запрещено подписаваться на самого себя
CANT_SUBSCRIBE_TO_YOURSELF = 'Нельзя подписываться на самого себя!'

#уже подписан на этого пользователя
ALREADY_SIGNED = 'Вы уже подписаны на пользователя'